In [2]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [4]:
data=pd.read_csv('Titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  WikiId       1304 non-null   float64
 13  Name_wiki    1304 non-null   object
 14  Age_wiki     1302 non-null   float64
 15  Hometown     1304 non-null   object
 16  Boarded      1304 non-null   object
 17  Destination  1304 non-null   object
 18  Lifeboat     502 non-null    object
 19  Body         130 non-null    object
 20  Class        1304 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 214.9+ KB

### number of passengers in each class

In [6]:
data.Pclass.value_counts()

3    709
1    323
2    277
Name: Pclass, dtype: int64

### single group single column

### count of passengers who survived  from each class

In [7]:
Pclass_Survived=data.groupby(['Pclass'])['Survived']

In [8]:
Pclass_Survived.sum()

Pclass
1    136.0
2     87.0
3    119.0
Name: Survived, dtype: float64

### multiple columns

 ### total amount paid by each class who survived

In [9]:
Pclass_Survived_Fare=data.groupby(['Pclass'])['Survived','Fare']

In [10]:
Pclass_Survived_Fare.sum()

        Survived        Fare
Pclass
1          136.0  28265.4043
2           87.0   5866.6374
3          119.0   9418.4452

### multiple groups

### count of femals and males who survived in each class

In [11]:
Pclass_Sex_Survived=data.groupby(['Pclass','Sex'])['Survived'] 
Pclass_Sex_Survived.sum()

Pclass  Sex
1       female    91.0
        male      45.0
2       female    70.0
        male      17.0
3       female    72.0
        male      47.0
Name: Survived, dtype: float64

In [12]:
Pclass_Sex_Survived=data.groupby(['Pclass','Sex'],as_index=False)['Survived'] 
Pclass_Sex_Survived.sum()

   Pclass     Sex  Survived
0       1  female      91.0
1       1    male      45.0
2       2  female      70.0
3       2    male      17.0
4       3  female      72.0
5       3    male      47.0

### multiple function

### mean and sum of pclass and survived

In [14]:
Pclass_Survived_mean_sum=data.groupby(['Pclass'])['Survived'].agg(['mean','sum'])

In [15]:
Pclass_Survived_mean_sum

            mean    sum
Pclass
1       0.629630  136.0
2       0.472826   87.0
3       0.242363  119.0

# examples:

In [17]:
Boarded_Survived=data.groupby(['Boarded'])['Survived']
Boarded_Survived.sum()

Boarded
Belfast          0.0
Cherbourg       93.0
Queenstown      29.0
Southampton    219.0
Name: Survived, dtype: float64

In [18]:
Hometown_Survived=data.groupby(['Hometown'])['Survived']
Hometown_Survived.sum()

Hometown
Abbeyleix, Laois, Ireland[note 1]    0.0
Abercynon, Glamorgan, Wales          0.0
Aberdeen, Aberdeenshire, Scotland    1.0
Aberdeen, Washington, US             0.0
Aclare, Sligo, Ireland               0.0
                                    ...
Örsjö, Kalmar, Sweden                0.0
Östra Sallerup, Skåne, Sweden        0.0
Øyer, Norway                         0.0
Široka Kula, Croatia                 0.0
Ḑuhūr ash Shuwayr, Lebanon           4.0
Name: Survived, Length: 566, dtype: float64

In [31]:
Survived_Age=data.groupby(['Survived'])['Age']
Survived_Age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [25]:
Pclass_Lifeboat=data.groupby(['Pclass'],as_index=False)['Lifeboat']
Pclass_Lifeboat.sum()

   Pclass                                           Lifeboat
0       1  4D8763D6107586966768DD5D8338106736114817483845...
1       2  ?131413141612101113??12109119D14B1014412141010...
2       3  14?1513C1315?1315CCDCDC131113DCB16C13C1315A16C...

In [26]:
Embarked_Parch=data.groupby(['Embarked'])['Parch']
Embarked_Parch.sum()

Embarked
C    100
Q     14
S    390
Name: Parch, dtype: int64

In [42]:
Age_Survived=data.groupby(['Age'])['Survived']
Age_Survived.sum()

Age
0.17     0.0
0.33     0.0
0.42     1.0
0.67     1.0
0.75     2.0
        ...
70.50    0.0
71.00    0.0
74.00    0.0
76.00    0.0
80.00    1.0
Name: Survived, Length: 98, dtype: float64